{
  "backend/main.mo": "Main Motoko actor defining all core types (Report, Activity, UserProfile, etc.) and backend logic for a museum monthly reporting system, including storage, access control, and user approval mixins.",
  "feature_evidence.json": "Feature evidence report mapping two export-related features (month/year selector and PDF/CSV export button on ReportsListPage) to their implementing files, components, and test IDs.",
  "frontend-file-summaries.txt": "A JSON document summarizing each frontend source file's purpose and key implementation details, serving as a reference for the frontend codebase structure.",
  "frontend/index.css": "Global Tailwind CSS stylesheet defining CSS custom properties for light and dark theme color tokens (background, foreground, primary, sidebar, charts, etc.).",
  "frontend/index.html": "HTML entry point for the React app, setting the page title to 'Museus Centro – Relatório Mensal Individual 2026' and mounting the app at the root div.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with all app routes, authentication guard via Internet Identity, profile setup modal, pending approval screen, and a sidebar layout wrapping all authenticated pages.",
  "frontend/src/components/ActivitiesList.tsx": "Component that fetches and displays a report's activities as cards with status/classification badges, audience info, and edit/add buttons based on user role and report ownership.",
  "frontend/src/components/ApprovalDetailView.tsx": "Displays a detailed view of a report for review, allowing coordinators/admins to approve, reject, or request adjustments with optional comments and a signature canvas.",
  "frontend/src/components/dashboard/ActivitiesByMuseumChart.tsx": "A bar chart component that visualizes activity counts per museum using Recharts, with truncated labels and multi-color bars.",
  "frontend/src/components/dashboard/AudienceByProfileChart.tsx": "Renders a pie chart breaking down audience by demographic profile (children, youth, adults, elderly, PCD) using Recharts, with a fallback message when no data is available.",
  "frontend/src/components/dashboard/KPICard.tsx": "A reusable card component for displaying a KPI metric with a title, value, optional icon, subtitle, and four visual variants (default, accent, success, warning).",
  "frontend/src/components/dashboard/MonthlyEvolutionChart.tsx": "Renders a line chart showing monthly audience evolution over time, sorting and labeling months in Portuguese using Recharts.",
  "frontend/src/components/dashboard/PlannedVsAchievedChart.tsx": "Renders a grouped bar chart comparing planned quantitative goals versus achieved results for goal-linked activities using Recharts.",
  "frontend/src/components/dashboard/PublicoGeralCard.tsx": "An interactive card that displays total general audience figures with selectable period modes (specific month, cumulative, or custom date range), fetching data via a query hook.",
  "frontend/src/components/dashboard/ReportsByMonthChart.tsx": "Renders a bar chart showing report counts per month, sorted in calendar order with Portuguese month labels and a custom tooltip.",
  "frontend/src/components/dashboard/ReportsByMuseumChart.tsx": "Renders a bar chart showing report counts per museum, truncating long museum names and displaying the full name in a custom tooltip.",
  "frontend/src/components/ExportConsolidatedExcelButton.tsx": "Renders a button (visible only to admins) that exports all reports and activities as a consolidated CSV/Excel file using the excelGenerator utility.",
  "frontend/src/components/ExportReportPDFButton.tsx": "A button component that triggers PDF generation for a single report and its activities using the pdfGenerator utility.",
  "frontend/src/components/Layout.tsx": "Root layout component that renders the Sidebar alongside a main content area using TanStack Router's Outlet.",
  "frontend/src/components/MonthYearSelector.tsx": "A pair of Select dropdowns for choosing a month and year, used to filter report data by time period.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that collects a new user's name and role (professional, coordination, or administration) and saves their profile on first login.",
  "frontend/src/components/Sidebar.tsx": "Application sidebar with role-based navigation links, user profile display, and a logout button.",
  "frontend/src/components/SignatureCanvas.tsx": "A canvas-based signature input component supporting mouse and touch drawing, with an imperative handle to retrieve the signature as a base64 string or clear it.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor based on the current Internet Identity, initializing access control and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login/logout flows, identity persistence, and exposing login status states to child components.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend actor interactions including user profiles, reports, activities, goals, and admin operations using @tanstack/react-query.",
  "frontend/src/index.css": "Global CSS file that imports fonts, sets up Tailwind directives, and defines CSS custom properties for light/dark theme color tokens including sidebar, card, and status colors.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/ActivityFormPage.tsx": "Form page for creating and editing activities, handling all activity fields (audience, goals, partnerships, evidences) with support for both create and edit modes via URL params.",
  "frontend/src/pages/ApprovalsPage.tsx": "Page for coordinators to view, filter, and manage report approvals, displaying a searchable/filterable list of reports with a slide-out detail view.",
  "frontend/src/pages/ConsolidatedMuseumPage.tsx": "Page that aggregates and displays consolidated activity and audience statistics for a selected museum, month, and year, with PDF and CSV export capabilities.",
  "frontend/src/pages/DashboardPage.tsx": "Renders a coordination dashboard with KPI cards, charts, and filters by museum/month, and provides an XLSX export of all reports and activities.",
  "frontend/src/pages/LoginPage.tsx": "Displays the login screen for the Museus Centro system, allowing users to authenticate via Internet Identity.",
  "frontend/src/pages/PendingApprovalPage.tsx": "Shows a waiting screen for users whose accounts are pending coordinator approval, with options to resend the approval request or log out.",
  "frontend/src/pages/ReportFormPage.tsx": "Provides a form for creating or editing monthly reports, including fields for professional info, narrative sections, and a signature canvas, with save and submit actions.",
  "frontend/src/pages/ReportsListPage.tsx": "Lists all reports for the current user with status badges, expandable activity details, and actions for editing, deleting, and exporting reports as PDF or Excel.",
  "frontend/src/pages/UserManagementPage.tsx": "Admin page for managing user profiles, allowing coordinators to approve, reject, edit, or delete users and their roles/museum assignments.",
  "frontend/src/utils/audienceValidation.ts": "Exports a function that validates whether the sum of audience demographic sub-groups (children, youth, adults, elderly, PCD) does not exceed the declared total audience, returning a validation result object.",
  "frontend/src/utils/consolidatedCsvGenerator.ts": "Generates and downloads a consolidated CSV file from multiple reports and their associated activities, with Portuguese label mappings for enums like status, month, and classification.",
  "frontend/src/utils/consolidatedPdfGenerator.ts": "Generates and downloads a consolidated PDF (via a print window) summarizing multiple reports and their activities, including aggregate totals for audience, activities, and hours.",
  "frontend/src/utils/excelGenerator.ts": "Generates and downloads a CSV-formatted Excel export of multiple reports and their activities, using the same column structure and Portuguese label mappings as the consolidated CSV generator.",
  "frontend/src/utils/labels.ts": "Centralizes Portuguese label mapping functions and constants for all backend enums (MuseumLocation, Month, Status, ActivityStatus, Classification, GoalStatus, AccessibilityOption, EvidenceType, etc.).",
  "frontend/src/utils/pdfGenerator.ts": "Generates and downloads a PDF for a single report and its activities by building an HTML string and opening it in a print window, with Portuguese label helpers for enums and date formatting.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme tokens (colors via OKLCH variables, fonts, shadows, border radii, animations) and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the project state for 'Museus Centro Reports', recording existing features (month/year selector and export button for monthly reports) and a pending new request to reinsert a monthly report export button with PDF/CSV support and a month/year selector."
}