{
  "backend/main.mo": "Main Motoko actor defining all core types (Report, Activity, UserProfile, etc.) and importing storage, authorization, and user-approval modules for the Museus Centro monthly reporting system.",
  "feature_evidence.json": "Feature evidence report documenting the implementation of the 'Público Geral' KPI card on the Dashboard, listing affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Auto-generated JSON summaries of all frontend source files, describing each component, page, hook, and utility along with notable fixes applied.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for the design system's color tokens in both light and dark themes.",
  "frontend/index.html": "Minimal HTML shell for the React SPA, setting the page title to 'Museus Centro – Relatório Mensal Individual 2026' and mounting the app at #root.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with all application routes, handles authentication via Internet Identity, and renders the sidebar layout with role-based navigation and profile setup modal.",
  "frontend/src/components/ActivitiesList.tsx": "Displays a list of activities for a given report as cards with status badges, classification, hours, and an optional 'Nova Atividade' button for navigation to the activity form.",
  "frontend/src/components/ApprovalDetailView.tsx": "Displays a detailed view of a report for coordinator review, allowing approval (with signature capture) or return for revision, with comments support.",
  "frontend/src/components/dashboard/ActivitiesByMuseumChart.tsx": "Renders a colored bar chart showing activity counts per museum using Recharts.",
  "frontend/src/components/dashboard/AudienceByProfileChart.tsx": "Renders a pie chart breaking down audience counts by demographic profile (children, youth, adults, elderly, PCD) using Recharts.",
  "frontend/src/components/dashboard/KPICard.tsx": "A styled card component for displaying a single KPI metric with a title, value, optional icon, subtitle, and color variant.",
  "frontend/src/components/dashboard/MonthlyEvolutionChart.tsx": "Renders a Recharts line chart showing audience evolution over months (Feb–Nov 2026), sorting and mapping month keys to Portuguese abbreviations.",
  "frontend/src/components/dashboard/PlannedVsAchievedChart.tsx": "Renders a grouped bar chart comparing planned (quantitativeGoal) vs achieved (achievedResult) values for goal-linked activities.",
  "frontend/src/components/dashboard/PublicoGeralCard.tsx": "Dashboard card that displays total general audience with selectable period modes (specific month, cumulative, or custom range), fetching data via useGetTotalGeneralAudience.",
  "frontend/src/components/dashboard/ReportsByMonthChart.tsx": "Renders a bar chart of report counts per month, sorted by a fixed month order, with a custom styled tooltip.",
  "frontend/src/components/dashboard/ReportsByMuseumChart.tsx": "Renders a bar chart of report counts per museum, truncating long museum names and showing the full name in a custom tooltip.",
  "frontend/src/components/ExportConsolidatedExcelButton.tsx": "Renders a button (visible only to admins) that exports all reports and activities as a consolidated CSV/Excel file.",
  "frontend/src/components/ExportReportPDFButton.tsx": "A button component that triggers PDF generation for a single report and its associated activities.",
  "frontend/src/components/Layout.tsx": "Root layout component that renders the Sidebar alongside a main content area using TanStack Router's Outlet.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog for first-time users to set their name and role (professional, coordination, or administration) before accessing the app.",
  "frontend/src/components/Sidebar.tsx": "Navigation sidebar that shows role-filtered nav items, user profile info, and a logout button using Internet Identity.",
  "frontend/src/components/SignatureCanvas.tsx": "A canvas-based signature drawing component with mouse/touch support, exposing imperative methods (get base64, clear, isEmpty) via a forwarded ref.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, initializing it with the current Internet Identity and an admin token, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, managing AuthClient creation, login, logout, and identity persistence with status tracking.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for the application, covering user profiles, approval status, reports, activities, goals, and dashboard data via the backend actor.",
  "frontend/src/index.css": "Global stylesheet that imports Inter and Plus Jakarta Sans fonts, sets up Tailwind directives, and defines CSS custom properties for light/dark themes including colors, sidebar, and radius variables.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider and InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/ActivityFormPage.tsx": "Form page for creating and editing activities, with label mappings for all enum types (classification, status, audience, products, evidence, accessibility) and fields for file uploads and activity metadata.",
  "frontend/src/pages/ApprovalsPage.tsx": "Page for coordinators to review and approve submitted reports, featuring search/filter controls by status, month, and museum, plus summary stats and a detail view component.",
  "frontend/src/pages/ConsolidatedMuseumPage.tsx": "Page that aggregates reports and activities by museum, month, and year, displaying totals for activities, audience, and products, with PDF and CSV export capabilities.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard page showing KPI cards and charts for reports and activities, with filters for museum and month, and an XLSX export button for coordination/admin users.",
  "frontend/src/pages/LoginPage.tsx": "Login page with Internet Identity authentication, displaying the Museus Centro branding, project description, and a login button with loading state.",
  "frontend/src/pages/PendingApprovalPage.tsx": "Displays a waiting screen for users whose accounts are pending coordinator approval, with options to resend the approval request or log out.",
  "frontend/src/pages/ReportFormPage.tsx": "Form page for creating or editing monthly reports, supporting draft saving, submission, and role-based field editing permissions for professionals and coordinators.",
  "frontend/src/pages/ReportsListPage.tsx": "Lists reports with search/filter controls, showing all reports to coordinators and personal reports to professionals, with actions for edit, view, delete, and XLSX export.",
  "frontend/src/pages/UserManagementPage.tsx": "Admin page for managing user profiles, allowing coordinators to approve, reject, edit roles/museums, and delete users, with special restrictions on the coordination role.",
  "frontend/src/utils/audienceValidation.ts": "Exports a validation function that checks whether the sum of audience demographic sub-groups does not exceed the declared total audience count.",
  "frontend/src/utils/consolidatedCsvGenerator.ts": "Generates and triggers download of a consolidated CSV file combining report metadata and their associated activities, with Portuguese label mappings for enums.",
  "frontend/src/utils/consolidatedPdfGenerator.ts": "Generates a consolidated PDF report for multiple reports and their activities, aggregating totals for audience, activities, and hours, and rendering them as styled HTML printed via the browser.",
  "frontend/src/utils/excelGenerator.ts": "Exports multiple reports and their associated activities as a CSV file with Portuguese-language headers and localized label mappings for status, classification, and museum location.",
  "frontend/src/utils/labels.ts": "Centralized utility module that provides Portuguese label mapping functions and constants for all backend enums including MuseumLocation, Month, Status, ActivityStatus, Classification, and others.",
  "frontend/src/utils/pdfGenerator.ts": "Generates a single-report PDF by building an HTML string with activity details and report metadata, then triggering a browser print dialog.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme tokens (colors via OKLCH, fonts, shadows, border radii, animations) and enabling the typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the state of the 'Museus Centro' dashboard project, including existing features and pending requests for a 'Público Geral' KPI card with period filter modes (current month, cumulative, custom date range). Contains architectural notes, known issues, and feature versioning metadata."
}