{
  "backend/main.mo": "Main Motoko actor defining all core types (Report, Activity, UserProfile, etc.) and backend logic for a museum monthly reporting system, including storage, authorization, and user approval mixins.",
  "feature_evidence.json": "Feature evidence report mapping three feature IDs (approve report button, activity fields restoration, app crash fix) to their relevant frontend files and component dependencies.",
  "frontend-file-summaries.txt": "A JSON document summarizing each frontend source file's purpose and key implementation details, serving as a reference for build planning and code navigation.",
  "frontend/index.css": "Global Tailwind CSS stylesheet defining CSS custom properties for light and dark theme color tokens (background, foreground, primary, sidebar, charts, etc.).",
  "frontend/index.html": "HTML entry point for the React app titled 'Museus Centro – Relatório Mensal Individual 2026', mounting the app at the root div and loading the main TSX module.",
  "frontend/src/App.tsx": "Root React application file that sets up TanStack Router with all routes, authentication guard via Internet Identity, profile setup modal, pending approval screen, and a sidebar layout wrapping all pages.",
  "frontend/src/components/ActivitiesList.tsx": "React component that fetches and displays a list of activity cards for a given report, with status/classification badges, edit navigation, and an 'Add Activity' button shown based on user role and report status.",
  "frontend/src/components/ApprovalDetailView.tsx": "Displays a detailed view of a report for review, allowing coordinators/admins to approve, request adjustments, or reject it with optional comments and a signature canvas.",
  "frontend/src/components/dashboard/ActivitiesByMuseumChart.tsx": "Renders a bar chart showing activity counts per museum using Recharts, with truncated labels and color-coded bars.",
  "frontend/src/components/dashboard/AudienceByProfileChart.tsx": "Renders a pie chart breaking down audience counts by demographic profile (children, youth, adults, elderly, PCD) using Recharts.",
  "frontend/src/components/dashboard/KPICard.tsx": "A styled card component for displaying a single KPI metric with a title, value, optional icon, subtitle, and color variant.",
  "frontend/src/components/dashboard/MonthlyEvolutionChart.tsx": "Renders a Recharts line chart showing monthly audience evolution, sorting and mapping month keys to Portuguese abbreviations.",
  "frontend/src/components/dashboard/PlannedVsAchievedChart.tsx": "Renders a grouped bar chart comparing planned (quantitative goal) vs achieved results for goal-linked activities.",
  "frontend/src/components/dashboard/PublicoGeralCard.tsx": "Dashboard card that displays total general audience with selectable period modes (specific month, cumulative, or custom range), fetching data via useGetTotalGeneralAudience.",
  "frontend/src/components/dashboard/ReportsByMonthChart.tsx": "Renders a bar chart of report counts per month, sorted by a fixed month order with a custom tooltip.",
  "frontend/src/components/dashboard/ReportsByMuseumChart.tsx": "Renders a bar chart of report counts per museum, truncating long museum names and showing full names in a custom tooltip.",
  "frontend/src/components/ExportConsolidatedExcelButton.tsx": "Renders a button (visible only to admins) that exports all reports and activities as a consolidated CSV/Excel file using a utility generator.",
  "frontend/src/components/ExportReportPDFButton.tsx": "A button component that triggers PDF generation for a single report and its activities using the pdfGenerator utility.",
  "frontend/src/components/Layout.tsx": "Root layout component that renders the Sidebar alongside a main content area using TanStack Router's Outlet, gating sidebar approval state from a query.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog for first-time users to set their name and access role (professional, coordination, or administration) before using the app.",
  "frontend/src/components/Sidebar.tsx": "Navigation sidebar that filters visible menu items based on the user's role and approval status, and provides a logout action.",
  "frontend/src/components/SignatureCanvas.tsx": "A canvas-based signature input component supporting mouse and touch drawing, exposing imperative handles to retrieve the signature as base64, clear it, or check if it's empty.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login, and identity persistence across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks (queries and mutations) for interacting with the backend actor, covering user profiles, reports, activities, dashboard data, and audience queries.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts (Inter, Plus Jakarta Sans), sets up Tailwind directives, and defines CSS custom properties for light/dark themes including colors, sidebar, and radius variables.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider (React Query) and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/ActivityFormPage.tsx": "Full-featured form page for creating and editing activities, with fields for status, classification, goals, accessibility, evidence, audience, and file uploads, using React state and custom query hooks.",
  "frontend/src/pages/ApprovalsPage.tsx": "Page for coordinators to review and approve submitted monthly reports, with search/filter controls by status and month, and a slide-in detail view for individual reports.",
  "frontend/src/pages/ConsolidatedMuseumPage.tsx": "Page that aggregates and displays activity and report data for a selected museum, month, and year, with options to export consolidated PDF and CSV reports.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard page showing KPI cards and charts for reports and activities, with museum/month filters and an XLSX export button, visible to coordinators.",
  "frontend/src/pages/LoginPage.tsx": "Login page with Internet Identity authentication, displaying the Museus Centro branding, project description, and a login button with loading state.",
  "frontend/src/pages/PendingApprovalPage.tsx": "Displays a waiting screen for users whose accounts are pending coordinator approval, with options to resend the approval request or log out.",
  "frontend/src/pages/ReportFormPage.tsx": "Form page for creating or editing monthly reports, supporting tabs for form fields and activities, with signature capture and submit/save actions.",
  "frontend/src/pages/ReportsListPage.tsx": "Lists reports for the current user with status badges, and provides actions to create, edit, delete, or add activities to reports based on user role and ownership.",
  "frontend/src/pages/UserManagementPage.tsx": "Admin page for managing user profiles, allowing coordinators to approve/reject pending users and edit or delete existing user roles and museum assignments.",
  "frontend/src/utils/audienceValidation.ts": "Exports a utility function that validates audience demographic breakdowns do not exceed the reported total audience count.",
  "frontend/src/utils/consolidatedCsvGenerator.ts": "Generates and triggers download of a consolidated CSV file combining report metadata and their associated activities, with localized Portuguese labels.",
  "frontend/src/utils/consolidatedPdfGenerator.ts": "Generates a consolidated PDF report for multiple reports and their activities, aggregating totals for audience, activities, and hours, and rendering them as styled HTML printed via the browser.",
  "frontend/src/utils/excelGenerator.ts": "Exports multiple reports and their associated activities as a CSV file with Portuguese-language headers and localized label mappings for status, classification, and museum location.",
  "frontend/src/utils/labels.ts": "Centralized utility module that provides Portuguese label mapping functions and constants for all backend enums including MuseumLocation, Month, Status, ActivityStatus, Classification, and others.",
  "frontend/src/utils/pdfGenerator.ts": "Generates a single-report PDF by building an HTML string with activity details and report metadata, then triggering a browser print dialog.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme tokens (colors via OKLCH, fonts, shadows, border radii, animations) and enabling the typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks project state for the 'Museus Centro' web app, documenting existing features, pending action requests (approve report button, activity restoration), known issues, and architectural notes at schema version 1.0.0."
}