{
  "backend/main.mo": "Main Motoko actor defining all core types (Report, Activity, UserProfile, etc.) and backend logic for a museum monthly reporting system, including storage, authorization, and user approval mixins.",
  "feature_evidence.json": "JSON manifest listing planned frontend features with associated file paths, component dependencies, test IDs, and confidence levels for file management, report-file linking, dashboard fixes, and React Query hooks.",
  "frontend-file-summaries.txt": "A JSON-formatted text file containing one-to-two sentence summaries of each frontend source file, serving as a reference for the current state and key fixes in each component, page, hook, and utility.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for the design system's color tokens in both light and dark themes, plus base body and border styles.",
  "frontend/index.html": "Minimal HTML shell for the React SPA titled 'Museus Centro – Relatório Mensal Individual 2026', mounting the app at the `#root` div and loading the Vite entry script.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with an auth-guard layout, handles login, profile setup modal, pending approval screen, sidebar layout, and defines all application routes including file management and nested activity routes.",
  "frontend/src/components/ActivitiesList.tsx": "Displays a list of activity cards for a given report with status/classification badges, loading/error states, and navigation to create or edit activities using nested route paths.",
  "frontend/src/components/ApprovalDetailView.tsx": "Displays a detailed view of a report for review, allowing coordinators/admins to approve, reject, or request adjustments with optional comments and a signature canvas.",
  "frontend/src/components/dashboard/ActivitiesByMuseumChart.tsx": "A dashboard card component that renders a bar chart showing activity counts per museum using Recharts, with a fallback empty state when no data is provided.",
  "frontend/src/components/dashboard/AudienceByProfileChart.tsx": "A dashboard card component that renders a donut pie chart breaking down audience counts by demographic profile (children, youth, adults, elderly, PCD) using Recharts.",
  "frontend/src/components/dashboard/KPICard.tsx": "A reusable KPI card component that displays a title, numeric value, optional subtitle, and a themed icon with color variants (default, success, warning, destructive).",
  "frontend/src/components/dashboard/MonthlyEvolutionChart.tsx": "A dashboard card that renders a bar chart showing monthly audience evolution, sorting months in chronological order using Recharts.",
  "frontend/src/components/dashboard/PlannedVsAchievedChart.tsx": "A dashboard card that renders a grouped bar chart comparing planned versus extra activities using Recharts, with an empty state when both values are zero.",
  "frontend/src/components/dashboard/PublicoGeralCard.tsx": "A dashboard card that fetches and displays total general audience from approved reports, allowing the user to toggle between cumulative total and a specific month/year via dropdowns.",
  "frontend/src/components/dashboard/ReportsByMonthChart.tsx": "A bar chart component that displays report counts grouped by month, sorted in calendar order, with an empty-state fallback when no data is available.",
  "frontend/src/components/dashboard/ReportsByMuseumChart.tsx": "A bar chart component that displays report counts per museum, truncating long museum names in axis labels while showing full names in a custom tooltip.",
  "frontend/src/components/ExportConsolidatedExcelButton.tsx": "Renders a button (visible only to admins) that exports all reports and activities as a consolidated CSV/Excel file using a utility generator.",
  "frontend/src/components/ExportReportPDFButton.tsx": "A simple button component that triggers PDF generation for a single report and its activities via a utility function.",
  "frontend/src/components/Layout.tsx": "Root layout component that renders the Sidebar alongside a main content area using TanStack Router's Outlet.",
  "frontend/src/components/MonthYearSelector.tsx": "A pair of dropdowns for selecting a month and year, used to filter reports by time period.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog shown to new users to collect their name and role (professional, coordination, or administration) and save their profile.",
  "frontend/src/components/ReportFilesSection.tsx": "Displays files linked to a report and provides a modal for linking or unlinking files from a global file list, with edit permission control.",
  "frontend/src/components/Sidebar.tsx": "Application sidebar with role-based navigation links, user avatar/info display, and a logout button.",
  "frontend/src/components/SignatureCanvas.tsx": "A forwardRef React component that renders a drawable HTML canvas for capturing signatures, supporting mouse and touch events, with methods exposed via ref to get the base64 image, clear, or check if empty.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor using TanStack Query, initializing it with the current Internet Identity and invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook for managing ICP Internet Identity authentication, including login, logout, and persisted identity state via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all TanStack Query hooks (queries and mutations) for interacting with the backend actor, covering user profiles, reports, activities, goals, and dashboard data with toast notifications on success/error.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures Tailwind, defines CSS custom properties for light/dark themes using OKLCH colors, and ensures Radix UI overlay components are fully opaque.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with TanStack QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/ActivityFormPage.tsx": "A form page for creating and editing activities, with fields covering scheduling, audience metrics, goals, partnerships, and accessibility options, backed by React state and custom query/mutation hooks.",
  "frontend/src/pages/ApprovalsPage.tsx": "Displays a filterable, searchable list of all submitted reports for coordinators to review and approve, opening a detail view in a Sheet component when a report is selected.",
  "frontend/src/pages/ConsolidatedMuseumPage.tsx": "Shows aggregated activity and audience statistics for a selected museum, month, and year, with options to export the consolidated data as PDF or CSV.",
  "frontend/src/pages/DashboardPage.tsx": "Renders a coordination dashboard with KPI cards and multiple charts (audience, activities, reports by museum/month), filterable by museum and month.",
  "frontend/src/pages/FileManagementPage.tsx": "Provides a file upload and management interface allowing users to upload, list, and delete file attachments stored on the backend.",
  "frontend/src/pages/LoginPage.tsx": "Renders the Internet Identity login page with branding for the Museus Centro project and a button to initiate authentication.",
  "frontend/src/pages/PendingApprovalPage.tsx": "Shown to users whose accounts are awaiting coordinator approval, offering options to resend the approval request or log out.",
  "frontend/src/pages/ReportFormPage.tsx": "A React page component for creating and editing monthly reports, with form fields for professional details, museum location, narrative sections, and an activities tab, supporting save/submit actions and signature capture.",
  "frontend/src/pages/ReportsListPage.tsx": "A React page that lists reports for the current user with filtering by month/year, supports editing, deleting, adding activities, and exporting individual reports as PDF or Excel.",
  "frontend/src/pages/UserManagementPage.tsx": "An admin page for managing user profiles, allowing coordinators to approve, reject, edit roles/museums, and delete users, with pending approvals highlighted.",
  "frontend/src/utils/audienceValidation.ts": "Exports a single validation function that checks whether the sum of audience demographic sub-groups does not exceed the declared total audience, returning a typed result object.",
  "frontend/src/utils/consolidatedCsvGenerator.ts": "Generates and downloads a consolidated CSV file containing report metadata and their associated activities, with Portuguese label mappings for enums and proper CSV escaping.",
  "frontend/src/utils/consolidatedPdfGenerator.ts": "Generates and downloads a consolidated HTML-based PDF document summarising multiple reports and their activities, including aggregate totals for audience, activities, and hours.",
  "frontend/src/utils/excelGenerator.ts": "Generates a CSV/Excel export from an array of Reports and their associated Activities, mapping enum values to Portuguese labels and formatting rows with all relevant report and activity fields.",
  "frontend/src/utils/labels.ts": "Centralised label-mapping utility that exports functions and constants for converting backend enums (MuseumLocation, Month, Status, ActivityStatus, Classification, GoalStatus, etc.) to Portuguese display strings.",
  "frontend/src/utils/pdfGenerator.ts": "Generates a printable HTML/PDF document for a single Report and its Activities by building an HTML string with styled tables and opening it in a new browser window for printing.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading, persisting, and clearing URL query parameters from both regular query strings and hash-based routes, using sessionStorage for cross-navigation persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that extends the default theme with custom fonts, OKLCH-based semantic color tokens, border radii, box shadows, accordion animations, and registers the typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the current project state at version 3, listing existing implemented features (file management, report file linking, dashboard fixes, React Query hooks) and known issues such as dashboard errors that still need fixing."
}