{
  "backend/main.mo": "Main Motoko actor defining all core types (Report, Activity, UserProfile, etc.) and backend logic for a museum monthly reporting system, including storage, access control, and user approval mixins.",
  "feature_evidence.json": "Feature evidence report documenting that transparency was removed from all dropdown/select overlay components by modifying `frontend/src/index.css`.",
  "frontend-file-summaries.txt": "A JSON-formatted text file containing short summaries of each frontend source file, serving as a build/planning reference for the frontend codebase.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties (design tokens) for light and dark themes including colors, borders, sidebar, and chart variables.",
  "frontend/index.html": "HTML entry point for the React app titled 'Museus Centro – Relatório Mensal Individual 2026', mounting the app at `#root` and loading `src/main.tsx`.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with all application routes, authentication guard via Internet Identity, profile setup modal, pending approval screen, and a sidebar layout.",
  "frontend/src/components/ActivitiesList.tsx": "Component that displays a list of activities for a given report as cards with status/classification badges, audience info, and edit/add buttons based on user role and report ownership.",
  "frontend/src/components/ApprovalDetailView.tsx": "Displays a detailed view of a report for review, allowing coordinators/admins to approve, reject, or request adjustments with optional comments and a signature canvas.",
  "frontend/src/components/dashboard/ActivitiesByMuseumChart.tsx": "A bar chart component that visualizes activity counts per museum using Recharts, with truncated labels and color cycling.",
  "frontend/src/components/dashboard/AudienceByProfileChart.tsx": "Renders a pie chart breaking down audience by demographic profile (children, youth, adults, elderly, PCD) using Recharts, with a fallback message when no data is available.",
  "frontend/src/components/dashboard/KPICard.tsx": "A reusable card component for displaying a KPI metric with a title, value, optional icon, subtitle, and four visual variants (default, accent, success, warning).",
  "frontend/src/components/dashboard/MonthlyEvolutionChart.tsx": "Renders a line chart showing monthly audience evolution over time, sorting and labeling months in Portuguese using Recharts.",
  "frontend/src/components/dashboard/PlannedVsAchievedChart.tsx": "Renders a grouped bar chart comparing planned quantitative goals versus achieved results for goal-linked activities using Recharts.",
  "frontend/src/components/dashboard/PublicoGeralCard.tsx": "An interactive card that displays total general audience figures with selectable period modes (specific month, cumulative, or custom date range), fetching data via a query hook.",
  "frontend/src/components/dashboard/ReportsByMonthChart.tsx": "Renders a bar chart showing report counts per month, sorted in calendar order with Portuguese month labels and a custom tooltip.",
  "frontend/src/components/dashboard/ReportsByMuseumChart.tsx": "Renders a bar chart showing report counts per museum, truncating long museum names and displaying full names in a custom tooltip.",
  "frontend/src/components/ExportConsolidatedExcelButton.tsx": "Renders a button (visible only to admins) that exports all reports and activities as a consolidated CSV/Excel file using a utility generator.",
  "frontend/src/components/ExportReportPDFButton.tsx": "A button component that triggers PDF generation for a single report and its associated activities.",
  "frontend/src/components/Layout.tsx": "Root layout component that renders the Sidebar alongside a main content area using TanStack Router's Outlet.",
  "frontend/src/components/MonthYearSelector.tsx": "A pair of dropdowns for selecting a month and year, used to filter report data by time period.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog for first-time users to set their name and access role (professional, coordination, or administration) before using the app.",
  "frontend/src/components/Sidebar.tsx": "Navigation sidebar that displays role-filtered nav items, user profile info, and a logout button.",
  "frontend/src/components/SignatureCanvas.tsx": "A canvas-based signature input component supporting mouse and touch drawing, with an imperative handle to retrieve the signature as a base64 string or clear it.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor using the current Internet Identity, initializing access control and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login/logout flow, identity persistence, and exposing login status states to child components.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend actor interactions including user profiles, reports, activities, goals, and admin operations using @tanstack/react-query.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures Tailwind, defines CSS custom properties for light/dark themes using oklch colors, and ensures Radix UI overlays are fully opaque.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/ActivityFormPage.tsx": "Form page for creating and editing activities, handling a large set of fields (audience, goals, partnerships, accessibility) with create/update mutations and pre-population from existing activity data.",
  "frontend/src/pages/ApprovalsPage.tsx": "Page for coordinators to view, filter, and manage report approvals, displaying a sortable list with search/status/month filters and a slide-out detail view.",
  "frontend/src/pages/ConsolidatedMuseumPage.tsx": "Page that aggregates reports and activities by museum, month, and year, displaying summary statistics and providing PDF/CSV export of consolidated data.",
  "frontend/src/pages/DashboardPage.tsx": "Renders a coordination dashboard with KPI cards, charts, and filters by museum/month, and provides an XLSX export of all reports and activities.",
  "frontend/src/pages/LoginPage.tsx": "Displays the login screen for the Museus Centro system with an Internet Identity login button and branding.",
  "frontend/src/pages/PendingApprovalPage.tsx": "Shows a waiting screen for users whose accounts are pending coordinator approval, with options to resend the approval request or log out.",
  "frontend/src/pages/ReportFormPage.tsx": "Provides a form for creating or editing monthly reports, including fields for professional info, narrative sections, and a signature canvas, with save and submit actions.",
  "frontend/src/pages/ReportsListPage.tsx": "Lists the current user's monthly reports with status badges, expandable activity details, and actions for editing, deleting, adding activities, and exporting to PDF or Excel.",
  "frontend/src/pages/UserManagementPage.tsx": "Admin page for managing user profiles, allowing coordinators to approve, reject, edit roles/museums, and delete users, with pending approvals highlighted.",
  "frontend/src/utils/audienceValidation.ts": "Exports a function that validates whether the sum of audience demographic profiles (children, youth, adults, elderly, PCD) does not exceed the declared total audience, returning a validation result object.",
  "frontend/src/utils/consolidatedCsvGenerator.ts": "Generates and downloads a consolidated CSV file from multiple reports and their associated activities, mapping enum values to Portuguese labels and formatting all fields into rows.",
  "frontend/src/utils/consolidatedPdfGenerator.ts": "Generates a consolidated PDF (via browser print) summarizing multiple reports and their activities, including aggregate totals for audience, activities, and hours, with Portuguese label mappings.",
  "frontend/src/utils/excelGenerator.ts": "Generates and downloads a CSV-formatted Excel export of multiple reports and their activities, using the same column structure and Portuguese label mappings as the consolidated CSV generator.",
  "frontend/src/utils/labels.ts": "Provides centralized helper functions and constants for converting backend enum values (MuseumLocation, Month, Status, ActivityStatus, Classification, etc.) to human-readable Portuguese labels.",
  "frontend/src/utils/pdfGenerator.ts": "Generates and opens a print-ready PDF for a single report and its activities, rendering report metadata and per-activity details as styled HTML with Portuguese label mappings.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from both query strings and hash-based routing, with helpers to persist, retrieve, and clear those parameters via sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme tokens (colors via OKLCH variables, fonts, border radii, shadows, animations) and enabling the typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata tracking a fix request to remove transparency from all dropdown/select/popover overlay components across the frontend, ensuring fully opaque backgrounds."
}