{
  "backend/main.mo": "Main Motoko actor defining all core types (Report, Activity, UserProfile, etc.) and importing authorization, blob storage, and user approval mixins for the Museus Centro monthly reporting system.",
  "feature_evidence.json": "Feature evidence report confirming that ReportFormPage and ActivityFormPage are non-read-only and fully editable/submittable for coordinator users in create mode.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of every frontend source file, describing their purpose and notable fixes or changes.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for light and dark theme color tokens (background, foreground, primary, chart colors, sidebar, etc.).",
  "frontend/index.html": "Minimal HTML shell for the React SPA, setting the page title to 'Museus Centro – Relatório Mensal Individual 2026' and mounting the app at `#root`.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with all application routes, handles authentication via Internet Identity, shows a login page or profile setup modal, and renders a role-based sidebar layout.",
  "frontend/src/components/ActivitiesList.tsx": "Displays a list of activities for a given report as cards with status badges, classification, hours, and audience info, plus a 'Nova Atividade' button when editing is allowed.",
  "frontend/src/components/ApprovalDetailView.tsx": "Read-only report detail view for Coordination/Admin users that shows report fields and activities, and provides coordinator comment input, signature canvas, and approve/return-for-revision actions.",
  "frontend/src/components/dashboard/ActivitiesByMuseumChart.tsx": "Recharts bar chart that displays activity counts per museum, truncating long museum names and applying a rotating color palette.",
  "frontend/src/components/dashboard/AudienceByProfileChart.tsx": "Recharts pie chart that visualizes audience breakdown by demographic profile (children, youth, adults, elderly, PCD) using labeled slices.",
  "frontend/src/components/dashboard/KPICard.tsx": "Reusable KPI card component displaying a label, numeric value, icon, and optional description with four color variants (default, accent, success, warning).",
  "frontend/src/components/dashboard/MonthlyEvolutionChart.tsx": "Recharts line chart that plots monthly audience totals sorted chronologically, mapping ISO month keys to Portuguese abbreviations.",
  "frontend/src/components/dashboard/PlannedVsAchievedChart.tsx": "Renders a grouped bar chart comparing planned (quantitative goal) vs achieved results for goal-linked activities, using Recharts.",
  "frontend/src/components/dashboard/ReportsByMonthChart.tsx": "Renders a bar chart showing report counts per month, sorted by a predefined academic-year month order, using Recharts.",
  "frontend/src/components/dashboard/ReportsByMuseumChart.tsx": "Renders a bar chart displaying report counts per museum with truncated labels and angled X-axis ticks, using Recharts.",
  "frontend/src/components/ExportConsolidatedExcelButton.tsx": "Admin-only button that aggregates all reports and activities into a map and triggers a CSV/Excel export via `generateExcelExport`, showing loading and error toasts.",
  "frontend/src/components/ExportReportPDFButton.tsx": "Simple button component that calls `generateReportPDF` with a given report and its activities to trigger a PDF download.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper that renders the Sidebar alongside a content area and a footer with copyright and a caffeine.ai attribution link.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that collects a new user's full name and role (professional, coordination, or administration) and saves the profile via `useSaveCallerUserProfile`.",
  "frontend/src/components/Sidebar.tsx": "Collapsible navigation sidebar that shows role-based nav items (reports, approvals, dashboard, consolidated view, user management, admin) and a logout button using the user's Internet Identity.",
  "frontend/src/components/SignatureCanvas.tsx": "A forwardRef canvas component supporting mouse and touch drawing for capturing signatures, exposing `getSignatureBase64`, `clear`, and `isEmpty` methods via an imperative handle.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, managing AuthClient creation, login, logout, and identity persistence across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks (queries and mutations) for interacting with the backend actor, covering user profiles, approvals, reports, and dashboard data.",
  "frontend/src/index.css": "Defines global Tailwind CSS styles, CSS custom properties for a navy-based institutional color palette (light and dark modes), and reusable component utility classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/ActivityFormPage.tsx": "A form page for creating and editing activities, with fields for status, classification, accessibility, evidence, and other activity metadata. Supports both create and update modes using React Query mutations.",
  "frontend/src/pages/ApprovalsPage.tsx": "Displays a filterable list of all reports for coordinators to review and approve, with status stats and a detail view for individual report approval.",
  "frontend/src/pages/ConsolidatedMuseumPage.tsx": "Shows aggregated activity and report data for a selected museum, month, and year, with options to export consolidated PDF and CSV reports.",
  "frontend/src/pages/DashboardPage.tsx": "A coordination/admin dashboard displaying KPI cards and charts (reports by museum, month, activities) with filters for month, museum, and professional name.",
  "frontend/src/pages/LoginPage.tsx": "A login page for the Museus Centro system that authenticates users via Internet Identity, displaying the project branding and a login button.",
  "frontend/src/pages/PendingApprovalPage.tsx": "A holding page shown to users whose accounts are awaiting coordinator approval, with options to resend the approval request or log out.",
  "frontend/src/pages/ReportFormPage.tsx": "A form page for creating and editing monthly reports, supporting draft/submit workflows with role-based read-only logic, activity management, and PDF export.",
  "frontend/src/pages/ReportsListPage.tsx": "A list page displaying all or user-specific reports with filtering by status, month, and museum, plus summary stats and navigation to create new reports.",
  "frontend/src/pages/UserManagementPage.tsx": "An admin page for managing user profiles, including approving pending users, editing roles/museums, and deleting accounts.",
  "frontend/src/utils/audienceValidation.ts": "Exports a single utility function that validates audience demographic breakdowns do not exceed the reported total audience count.",
  "frontend/src/utils/consolidatedCsvGenerator.ts": "Generates and downloads a consolidated CSV file combining report metadata and their associated activities, with Portuguese label mappings for enums.",
  "frontend/src/utils/consolidatedPdfGenerator.ts": "Generates a consolidated HTML-based PDF document summarizing multiple reports and their activities, including aggregate totals for audience, activities, and hours.",
  "frontend/src/utils/excelGenerator.ts": "Generates and downloads a CSV/Excel export of reports and their activities, mapping enum values to Portuguese labels and formatting dates and audience data into rows.",
  "frontend/src/utils/labels.ts": "Provides exported helper functions that convert backend enum values (MuseumLocation, Month, Status, ActivityStatus, etc.) to human-readable Portuguese label strings.",
  "frontend/src/utils/pdfGenerator.ts": "Generates a printable HTML-based PDF for a single report and its activities, rendering report metadata and per-activity details with Portuguese labels.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading URL query parameters (including from hash-based routes), persisting them to sessionStorage, and cleaning sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that sets up dark mode, custom color palettes (navy, teal, semantic tokens via CSS variables), typography, container queries, and animation plugins.",
  "project_state.json": "Tracks project metadata, existing features, and pending feature requests (AR-1 through AR-4) related to adding coordinator role permissions for report/activity creation on both backend and frontend."
}