{
  "backend/main.mo": "Main Motoko actor defining all core types (Report, Activity, UserProfile, etc.) and application logic for a museum monthly reporting system, including role-based access control, blob storage, and user approval mixins.",
  "backend/migration.mo": "Data migration module that upgrades user profiles by assigning the `#coordination` role to principals whose registered email matches a hardcoded list of privileged addresses.",
  "feature_evidence.json": "Empty feature evidence report JSON file used to track implemented features, currently containing no entries.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of all frontend source files, serving as a reference for the frontend codebase structure and recent changes.",
  "frontend/index.css": "Global CSS file that sets up Tailwind directives and defines CSS custom properties for the design system's color tokens in both light and dark themes.",
  "frontend/index.html": "HTML entry point for the Vite/React frontend, setting the page title to 'Museus Centro – Relatório Mensal Individual 2026' and mounting the React app at `#root`.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with all application routes, an auth-guard layout handling login, profile setup, and pending approval states, plus a global Sonner toast provider.",
  "frontend/src/components/ActivitiesList.tsx": "Component that renders a list of activity cards with status badges and edit buttons for a given report, and includes a button to navigate to the new activity form when editing is allowed.",
  "frontend/src/components/ApprovalDetailView.tsx": "Displays a detailed view of a report pending approval, showing report metadata and expandable activity cards with evidences, and provides approve/return-with-comments actions via dialogs.",
  "frontend/src/components/dashboard/ActivitiesByMuseumChart.tsx": "Renders a bar chart showing activity counts per museum using Recharts, with truncated labels and a custom tooltip displaying the full museum name.",
  "frontend/src/components/dashboard/AudienceByProfileChart.tsx": "Renders a bar chart breaking down audience counts by demographic profile (children, youth, adults, elderly, PCD) using Recharts.",
  "frontend/src/components/dashboard/KPICard.tsx": "A simple card component that displays a KPI metric with a title, formatted numeric or string value, optional icon, and optional subtitle.",
  "frontend/src/components/dashboard/MonthlyEvolutionChart.tsx": "Renders a line chart showing monthly activity counts sorted in calendar order (February–November) with Portuguese month labels.",
  "frontend/src/components/dashboard/PlannedVsAchievedChart.tsx": "Renders a grouped bar chart comparing planned versus extra activities using Recharts, with a custom tooltip and legend.",
  "frontend/src/components/dashboard/PublicoGeralCard.tsx": "A card component that displays total general audience figures, toggling between cumulative total and current month via query hooks and button controls.",
  "frontend/src/components/dashboard/ReportsByMonthChart.tsx": "Renders a bar chart showing report counts per month sorted in calendar order (February–November) with Portuguese month labels.",
  "frontend/src/components/dashboard/ReportsByMuseumChart.tsx": "Renders a bar chart showing report counts per museum with truncated axis labels and a custom tooltip displaying the full museum name.",
  "frontend/src/components/ExportConsolidatedExcelButton.tsx": "Renders a button (visible only to administration/coordination roles) that exports all reports and activities as a consolidated Excel file.",
  "frontend/src/components/ExportReportPDFButton.tsx": "Renders a button that triggers PDF generation for a single report and its associated activities.",
  "frontend/src/components/Layout.tsx": "Root layout component that renders the Sidebar alongside a main content area using TanStack Router's Outlet.",
  "frontend/src/components/MonthYearSelector.tsx": "Provides two dropdowns for selecting a month and year, used as a reusable filter control across the app.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that collects a new user's full name and team, then saves their profile with the professional role via a mutation.",
  "frontend/src/components/ReportFilesSection.tsx": "Displays files linked to a report and allows users to link or unlink files from a global file list via dialogs.",
  "frontend/src/components/Sidebar.tsx": "Navigation sidebar that shows role-filtered nav items, the user's profile/initials, and a logout button using Internet Identity.",
  "frontend/src/components/SignatureCanvas.tsx": "A canvas-based signature input component supporting mouse and touch drawing, exposing imperative methods (getSignature, clear, isEmpty) via a forwarded ref.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor using the current Internet Identity, initializing access control and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login/logout flow, identity persistence, and login status state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including user profile CRUD, role management, approval workflows, and report/activity operations using the ICP actor.",
  "frontend/src/index.css": "Global stylesheet that imports Plus Jakarta Sans font, sets up Tailwind CSS, and defines CSS custom properties for light/dark theme tokens including colors, sidebar, and chart variables.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/ActivityFormPage.tsx": "Form page for creating and editing activities within a report, handling fields like museum, date, audience, products, and status with create/update mutations.",
  "frontend/src/pages/ApprovalsPage.tsx": "Admin page listing pending reports with search/filter, allowing reviewers to approve or return reports with comments via dialogs and mutations.",
  "frontend/src/pages/ConsolidatedMuseumPage.tsx": "Dashboard page showing consolidated KPI metrics (reports, activities, hours, audience) filtered by museum/team, with an Excel export button.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the coordination dashboard with KPI cards and multiple charts (activities by museum, audience by profile, monthly evolution, etc.), supporting filters by month and museum using data from the useCoordinationDashboard hook.",
  "frontend/src/pages/FileManagementPage.tsx": "Provides a file management UI allowing users to upload, search, download, and delete file attachments, using useListFiles, useUploadFile, and useDeleteFile hooks.",
  "frontend/src/pages/LoginPage.tsx": "Displays the login page with the Museus Centro branding and an Internet Identity login button, handling the logging-in state visually.",
  "frontend/src/pages/PendingApprovalPage.tsx": "Shows a waiting screen for users whose accounts are pending coordinator approval, with options to request approval or log out.",
  "frontend/src/pages/ReportFormPage.tsx": "Implements the report creation and editing form with fields for professional info, museum, month/year, narrative sections, and a signature canvas, supporting save, submit, and activity management.",
  "frontend/src/pages/ReportsListPage.tsx": "Lists the current user's reports with search, expandable activity rows, PDF export, edit, and delete functionality using report and activity query hooks.",
  "frontend/src/pages/UserManagementPage.tsx": "Admin page for managing user profiles, supporting search, edit (name/role/team), delete, approve, and reject actions with role-based access control and toast notifications.",
  "frontend/src/types.ts": "Defines all shared TypeScript types and interfaces for the frontend, including enums for status, roles, and classifications, plus data shapes for Report, Activity, FileEvidence, and AudienceBreakdown.",
  "frontend/src/utils/audienceValidation.ts": "Exports a single validation function that checks whether the sum of audience demographic breakdowns does not exceed the total audience count, returning a result object with validity status and error message.",
  "frontend/src/utils/consolidatedCsvGenerator.ts": "Generates and triggers a CSV file download containing a consolidated summary of reports and their aggregated activity metrics (hours, audience, activity count), including a totals row.",
  "frontend/src/utils/consolidatedPdfGenerator.ts": "Generates and triggers a PDF download of consolidated reports with per-report activity details, summary statistics, and HTML-based formatting for print output.",
  "frontend/src/utils/excelGenerator.ts": "Generates a CSV export (formatted for Excel) with two sections—reports and activities—mapping internal enum values to Portuguese labels and triggering a file download.",
  "frontend/src/utils/labels.ts": "Provides label/display string utilities and constants for enums like museum locations, months, statuses, activity statuses, and classifications, including Tailwind CSS color classes for status badges.",
  "frontend/src/utils/pdfGenerator.ts": "Generates a printable HTML/PDF report from a Report and its Activities, with local helper functions for translating enum values to Portuguese labels and formatting dates/times.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters from both regular and hash-based routes, persisting them in sessionStorage, and cleaning sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom color tokens (using oklch CSS variables), typography, border radius, box shadows, accordion keyframes, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks the project's current state and pending feature requests, specifically noting that two users need their roles elevated from coordinator to administrator in the backend canister."
}