{
  "backend/main.mo": "Main Motoko actor defining all core types (Report, Activity, UserProfile, enums) and importing authorization, blob storage, and user approval mixins for a museum monthly reporting system.",
  "feature_evidence.json": "Feature evidence report mapping two user-approval features (pending users section and pending-status access restriction) to their implementing frontend files and component dependencies.",
  "frontend-file-summaries.txt": "Auto-generated JSON summaries of all frontend source files, describing the purpose and key changes of each component, page, hook, and utility in the React frontend.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for light and dark theme color tokens (background, foreground, primary, sidebar, charts, etc.).",
  "frontend/index.html": "HTML shell for the React app titled 'Museus Centro – Relatório Mensal Individual 2026', mounting the app at the root div and loading the main TSX entry point.",
  "frontend/src/App.tsx": "Root React app component setting up TanStack Router with all routes, auth guard via Internet Identity, profile setup modal, and approval status check that redirects unapproved non-coordinator users to PendingApprovalPage.",
  "frontend/src/components/ActivitiesList.tsx": "Displays a report's activities as cards with status/classification badges, hours display (numeric or 'Não se aplica'), audience info, and an edit navigation button.",
  "frontend/src/components/ApprovalDetailView.tsx": "Displays a detailed view of a single report for coordinator review, allowing the coordinator to add comments, draw a signature, and either approve the report or return it for revision.",
  "frontend/src/components/dashboard/ActivitiesByMuseumChart.tsx": "Renders a colored bar chart showing the number of activities per museum using Recharts, with truncated labels and a full-name tooltip.",
  "frontend/src/components/dashboard/AudienceByProfileChart.tsx": "Renders a pie chart breaking down audience counts by demographic profile (children, youth, adults, elderly, PCD) using Recharts.",
  "frontend/src/components/dashboard/KPICard.tsx": "A reusable KPI card component that displays a label, value, icon, and optional description with four visual variants (default, accent, success, warning).",
  "frontend/src/components/dashboard/MonthlyEvolutionChart.tsx": "A line chart component that visualizes monthly audience evolution data, mapping month keys to Portuguese abbreviations and rendering via Recharts.",
  "frontend/src/components/dashboard/PlannedVsAchievedChart.tsx": "A grouped bar chart comparing planned (quantitative goal) vs. achieved results for goal-linked activities, rendered with Recharts.",
  "frontend/src/components/dashboard/ReportsByMonthChart.tsx": "A bar chart displaying report counts per month, sorted by a fixed month order and using a custom tooltip, built with Recharts.",
  "frontend/src/components/dashboard/ReportsByMuseumChart.tsx": "A bar chart showing report counts per museum with truncated labels and a custom tooltip, rendered with Recharts.",
  "frontend/src/components/ExportConsolidatedExcelButton.tsx": "Renders a button (visible only to admins) that aggregates all reports and activities and triggers a CSV/Excel export via the generateExcelExport utility.",
  "frontend/src/components/ExportReportPDFButton.tsx": "A simple button component that triggers PDF generation for a single report and its activities using the generateReportPDF utility.",
  "frontend/src/components/Layout.tsx": "Wraps page content with a persistent Sidebar and a footer, providing the main application shell layout.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog shown to new users to collect their full name and access role (professional, coordination, or administration) before saving their profile.",
  "frontend/src/components/Sidebar.tsx": "Collapsible navigation sidebar that renders role-based nav items (reports, approvals, dashboard, etc.) and a logout button based on the current user's profile.",
  "frontend/src/components/SignatureCanvas.tsx": "A canvas-based signature drawing component with mouse and touch support, exposing imperative handles to retrieve the signature as a base64 string or clear it.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing ICP Internet Identity authentication state, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks (queries and mutations) for interacting with the backend actor, covering reports, user profiles, activities, and dashboard data.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures Tailwind CSS, and defines a navy/teal institutional design token palette for both light and dark modes along with reusable component utility classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/ActivityFormPage.tsx": "A form page for creating and editing Activity records, handling all activity fields (dates, audience, accessibility, evidences, etc.) with validation and submission via create/update mutation hooks.",
  "frontend/src/pages/ApprovalsPage.tsx": "A page for coordination/admin users to view and filter all reports by status, month, museum, and professional name, with a drill-down into an ApprovalDetailView component.",
  "frontend/src/pages/ConsolidatedMuseumPage.tsx": "A page that aggregates and displays consolidated activity and audience statistics for a selected museum, month, and year, with PDF and CSV export capabilities.",
  "frontend/src/pages/DashboardPage.tsx": "A coordination/admin dashboard page showing KPI cards and charts (reports by museum/month, activities, audience breakdown) with month, museum, and professional filters.",
  "frontend/src/pages/LoginPage.tsx": "A login page that authenticates users via Internet Identity, displaying the Museus Centro branding and a login button with loading state.",
  "frontend/src/pages/PendingApprovalPage.tsx": "A holding page shown to users whose accounts are awaiting coordinator approval, offering options to resend the approval request or log out.",
  "frontend/src/pages/ReportFormPage.tsx": "A full-featured report form page that supports creating, editing, submitting, and downloading reports as PDF, with role-based field access for professionals, coordination, and admins, including a signature canvas component.",
  "frontend/src/pages/ReportsListPage.tsx": "A paginated, filterable list page for reports that shows all reports to coordinators/admins and only personal reports to professionals, with filters for status, month, museum, professional name, and date range.",
  "frontend/src/pages/UserManagementPage.tsx": "An admin-only user management page that lists all user profiles in a table and supports editing user name/role/museum, approving pending users, and deleting users via dialogs.",
  "frontend/src/utils/audienceValidation.ts": "Exports a single validation function that checks whether the sum of audience sub-groups (children, youth, adults, elderly, PCD) does not exceed the declared total audience.",
  "frontend/src/utils/consolidatedCsvGenerator.ts": "Generates and triggers a CSV download containing consolidated data for multiple reports and their associated activities, with Portuguese label mappings for enums and proper CSV escaping.",
  "frontend/src/utils/consolidatedPdfGenerator.ts": "Generates and triggers a PDF download of a consolidated report document covering multiple reports and their activities, including summary totals for audience, activities, and hours.",
  "frontend/src/utils/excelGenerator.ts": "Generates and downloads a CSV/Excel export of reports and their activities, mapping enum values to Portuguese labels and formatting rows with report metadata and activity details.",
  "frontend/src/utils/labels.ts": "Provides reusable helper functions that convert backend enum values (MuseumLocation, Month, Status, ActivityStatus, etc.) into human-readable Portuguese label strings.",
  "frontend/src/utils/pdfGenerator.ts": "Generates a printable HTML-based PDF for a single report and its activities, rendering report metadata and activity cards with Portuguese-localized labels.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading URL query parameters (supporting both standard and hash-based routing), persisting them in sessionStorage, and cleaning sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that sets up dark mode, custom color palettes (navy, teal, semantic tokens via CSS variables), custom fonts (Inter, Sora), and enables typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the project's current state including existing features, pending feature requests, and metadata for the 'Museus Centro' app, specifically around a coordinator approval flow for new users."
}