{
  "backend/main.mo": "Main Motoko actor defining all core types (Report, Activity, UserProfile, etc.) and composing authorization, blob storage, and user approval mixins with a migration hook for the ICP backend.",
  "backend/migration.mo": "Migration module that transforms stored user profiles by removing the deprecated `generalCoordinator` role, mapping it to `coordinator` for all existing users.",
  "feature_evidence.json": "Feature evidence report confirming that the User Management page and labels utility were updated to remove the 'Coordenador Geral' role from the dropdown and display, reflecting the backend migration.",
  "frontend-file-summaries.txt": "Auto-generated summary file listing concise descriptions of all frontend source files, their purposes, and key changes made across the React/TypeScript frontend codebase.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for the design system's color tokens in both light and dark themes.",
  "frontend/index.html": "Minimal HTML shell for the React SPA, setting the page title to 'Museus Centro – Relatório Mensal Individual 2026' and mounting the app at `#root`.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with all application routes, an auth guard layout handling login/profile setup/pending approval states, and a global Toaster for notifications.",
  "frontend/src/components/ActivitiesList.tsx": "Reusable component that renders a list of activity cards with status badges, audience info, and edit navigation buttons, plus a button to add new activities when editing is allowed.",
  "frontend/src/components/ApprovalDetailView.tsx": "Displays a detailed view of a report pending approval, showing report metadata and expandable activity cards with evidences, and provides approve/return-with-comments actions via dialogs.",
  "frontend/src/components/dashboard/ActivitiesByMuseumChart.tsx": "Renders a bar chart showing activity counts per museum using Recharts, with truncated labels and a custom tooltip displaying the full museum name.",
  "frontend/src/components/dashboard/AudienceByProfileChart.tsx": "Renders a bar chart breaking down audience counts by demographic profile (children, youth, adults, elderly, PCD) using Recharts.",
  "frontend/src/components/dashboard/KPICard.tsx": "A simple card component that displays a KPI metric with a title, formatted numeric or string value, optional icon, and optional subtitle.",
  "frontend/src/components/dashboard/MonthlyEvolutionChart.tsx": "Renders a line chart showing the monthly evolution of activities, sorting and labeling months in Portuguese using Recharts.",
  "frontend/src/components/dashboard/PlannedVsAchievedChart.tsx": "Renders a grouped bar chart comparing planned versus extra activities using Recharts, with a custom tooltip.",
  "frontend/src/components/dashboard/PublicoGeralCard.tsx": "A card component that displays total general audience figures, toggling between cumulative total and current month via buttons, fetching data with a custom query hook.",
  "frontend/src/components/dashboard/ReportsByMonthChart.tsx": "Renders a bar chart showing report counts per month, sorted and labeled in Portuguese using Recharts.",
  "frontend/src/components/dashboard/ReportsByMuseumChart.tsx": "Renders a bar chart showing report counts per museum with truncated axis labels and a custom tooltip displaying the full museum name.",
  "frontend/src/components/ExportConsolidatedExcelButton.tsx": "Renders a button (visible only to administration/coordination roles) that exports all reports and activities as a consolidated Excel file.",
  "frontend/src/components/ExportReportPDFButton.tsx": "Renders a button that triggers PDF generation for a single report and its associated activities.",
  "frontend/src/components/Layout.tsx": "Root layout component that renders the Sidebar alongside a main content area using TanStack Router's Outlet.",
  "frontend/src/components/MonthYearSelector.tsx": "Provides two dropdowns for selecting a month and a year, used as a reusable filter control across the app.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that collects a new user's full name and team, then saves their profile with the 'professional' role via a mutation.",
  "frontend/src/components/ReportFilesSection.tsx": "Displays files linked to a report and allows linking or unlinking files from an available file list via dialogs.",
  "frontend/src/components/Sidebar.tsx": "Navigation sidebar that shows role-filtered nav items, the user's profile, and a logout button using Internet Identity.",
  "frontend/src/components/SignatureCanvas.tsx": "A canvas-based signature input component supporting mouse and touch drawing, exposing imperative methods (getSignature, clear, isEmpty) via a forwarded ref.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor using React Query, initializing it with an authenticated or anonymous identity and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login, logout, and identity persistence with status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including user profiles, approvals, reports, and activities using the actor pattern. Exports typed query and mutation hooks that wrap canister actor calls.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind, imports Plus Jakarta Sans font, and defines CSS custom properties for light/dark theme tokens including colors, sidebar, and chart variables.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/ActivityFormPage.tsx": "Form page for creating and editing activities within a report, handling fields like museum, date, audience, products, and status with create/update mutations.",
  "frontend/src/pages/ApprovalsPage.tsx": "Admin page listing pending reports with search/filter controls, allowing reviewers to approve or return reports with comments via dialogs.",
  "frontend/src/pages/ConsolidatedMuseumPage.tsx": "Dashboard page showing consolidated report and activity statistics filtered by museum/team, displaying KPI cards for totals and an Excel export button.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the coordination dashboard with KPI cards and multiple charts (activities by museum, audience by profile, monthly evolution, etc.), supporting filters by month and museum. Fetches data via useCoordinationDashboard and converts bigint values to numbers for chart rendering.",
  "frontend/src/pages/FileManagementPage.tsx": "Provides a file management UI allowing users to upload, search, download, and delete file attachments, with confirmation dialogs for deletion. Uses useListFiles, useUploadFile, and useDeleteFile hooks for data operations.",
  "frontend/src/pages/LoginPage.tsx": "Displays the login page with the Museus Centro branding and an Internet Identity login button. Handles login state feedback with a spinner during the authentication process.",
  "frontend/src/pages/PendingApprovalPage.tsx": "Shows a waiting screen for users whose accounts are pending coordinator approval, with options to request approval or log out. Uses useRequestApproval to send an approval request and tracks submission state locally.",
  "frontend/src/pages/ReportFormPage.tsx": "Form page for creating or editing monthly activity reports, including fields for professional info, museum assignment, narrative sections, and a signature canvas. Supports save-as-draft and submit actions via useCreateReport, useUpdateReport, and useSubmitReport hooks.",
  "frontend/src/pages/ReportsListPage.tsx": "Lists the current user's reports with search filtering, inline activity expansion, PDF export, edit, and delete capabilities. Each report row is rendered by ReportActivitiesRow, which lazily loads activities on expand.",
  "frontend/src/pages/UserManagementPage.tsx": "Admin page for managing user profiles, supporting search, edit (name/role/team), delete, approve, and reject actions via React Query mutations with toast notifications.",
  "frontend/src/types.ts": "Defines all shared TypeScript types and interfaces for the frontend, including Report, Activity, enums for status/classification/audience, and file evidence structures.",
  "frontend/src/utils/audienceValidation.ts": "Exports a single validation function that checks whether the sum of audience demographic breakdowns does not exceed the total audience count.",
  "frontend/src/utils/consolidatedCsvGenerator.ts": "Generates and triggers a CSV download of consolidated report data (with per-report activity/hour/audience totals and a summary row) from arrays of Reports and Activities.",
  "frontend/src/utils/consolidatedPdfGenerator.ts": "Generates an HTML-based PDF document summarizing consolidated reports and their activities, including totals for hours and audience, then triggers a browser print/download.",
  "frontend/src/utils/excelGenerator.ts": "Generates a two-section CSV export (reports and activities) formatted for Excel consumption, with localized labels for months, statuses, and classifications.",
  "frontend/src/utils/labels.ts": "Provides label mapping functions and constants for enums like museum locations, months, statuses, activity statuses, and classifications, including Tailwind CSS color classes for status badges.",
  "frontend/src/utils/pdfGenerator.ts": "Generates a printable HTML/PDF report for a given Report and its Activities, with local label helpers for statuses, classifications, locations, and date formatting.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters (supporting both regular and hash-based routing), persisting them to sessionStorage, and cleaning sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom color tokens using OKLCH CSS variables, extended fonts, shadows, border radii, and accordion keyframe animations, plus typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the project's current state, existing features, and pending feature requests, specifically noting a migration task to rename the 'generalCoordinator' role to 'coordinator' across users and the UI."
}