{
  "kind": "build_request",
  "title": "Grant Coordinator Role Access to Create Reports and Insert Activities",
  "projectName": "Museus Centro",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the backend authorization logic so that users with the 'coordination' (coordinator) role are permitted to call the createReport (or equivalent) function, in addition to the roles that already have this permission.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "adicione ao coordenador o acesso a criar relat贸rio e inserir atividades"
        ]
      },
      "acceptanceCriteria": [
        "A user with the coordinator role can successfully create a new report via the backend without receiving an authorization error.",
        "Existing roles that could already create reports continue to work without regression."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the backend authorization logic so that users with the 'coordination' (coordinator) role are permitted to call the createActivity (or equivalent) function, in addition to the roles that already have this permission.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "adicione ao coordenador o acesso a criar relat贸rio e inserir atividades"
        ]
      },
      "acceptanceCriteria": [
        "A user with the coordinator role can successfully insert a new activity into a report via the backend without receiving an authorization error.",
        "Existing roles that could already insert activities continue to work without regression."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the frontend Sidebar navigation so that the coordinator role sees menu items for creating reports (e.g., link to ReportFormPage in create mode) and inserting activities (e.g., link or access to ActivityFormPage), if those links are currently hidden or disabled for coordinators.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "adicione ao coordenador o acesso a criar relat贸rio e inserir atividades"
        ]
      },
      "acceptanceCriteria": [
        "When logged in as a coordinator, the Sidebar displays the navigation option to create a new report.",
        "When logged in as a coordinator and viewing a report, the option to add a new activity is visible and functional.",
        "No navigation items are broken for other roles."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Ensure that the ReportFormPage does not render as read-only for coordinator users when accessed in create mode, and that the ActivityFormPage create form is fully editable and submittable by coordinator users.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "adicione ao coordenador o acesso a criar relat贸rio e inserir atividades"
        ]
      },
      "acceptanceCriteria": [
        "A coordinator user can fill out and submit the report creation form without fields being disabled or the form being read-only.",
        "A coordinator user can fill out and submit the activity creation form without fields being disabled.",
        "Role-based read-only logic in ReportFormPage does not block coordinators in create mode."
      ]
    }
  ],
  "constraints": [
    "Do not remove or reduce any existing permissions for other roles (professional, administration).",
    "The coordinator role must not gain access to admin-only features such as user management or consolidated Excel export."
  ],
  "nonGoals": [
    "Changing the coordinator's ability to approve/reject reports (already in scope for that role).",
    "Modifying the user approval workflow or admin-only features.",
    "Adding new roles or changing the role model structure."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}