{
  "kind": "build_request",
  "title": "Add 'Público Geral' metric with period filters to Dashboard",
  "projectName": "Museus Centro",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a backend query function that returns the total general audience ('público geral') aggregated across all approved/submitted reports, supporting three filter modes: (1) a specific month+year, (2) cumulative total (all time), and (3) a custom date range defined by start month+year and end month+year.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "no dashboard insira o publico geral no periodo do mes o acumulado ou datra customizada"
        ]
      },
      "acceptanceCriteria": [
        "A new query function exists that accepts a period filter variant: #month(month, year), #cumulative, or #customRange(startMonth, startYear, endMonth, endYear).",
        "The function returns the sum of the 'publicoGeral' (or equivalent audience total field) from all qualifying activity/report records matching the filter.",
        "The cumulative mode returns the sum across all records regardless of date.",
        "The monthly mode returns the sum for the specified month and year only.",
        "The custom range mode returns the sum for all months inclusively between start and end."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a 'Público Geral' KPI card to the Dashboard page that displays the total general audience value. Include a period selector control allowing the user to switch between three modes: 'Mês Atual' (current month), 'Acumulado' (cumulative), and 'Período Customizado' (custom date range). When 'Período Customizado' is selected, show start and end month/year pickers. The KPI card should update reactively when the period selection changes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "no dashboard insira o publico geral no periodo do mes o acumulado ou datra customizada"
        ]
      },
      "acceptanceCriteria": [
        "A 'Público Geral' KPI card is visible on the DashboardPage.",
        "A period selector with three options is rendered near or within the KPI card: 'Mês Atual', 'Acumulado', 'Período Customizado'.",
        "Selecting 'Mês Atual' fetches and displays the audience total for the current calendar month and year.",
        "Selecting 'Acumulado' fetches and displays the cumulative audience total across all records.",
        "Selecting 'Período Customizado' reveals two month+year pickers (start and end); the card updates when valid dates are selected.",
        "The card displays a loading state while the query is in flight and an error state if the query fails.",
        "The KPI card uses the existing KPICard component and visual design system for consistency."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "Reuse the existing KPICard component for the new metric display.",
    "All Motoko logic must remain in the single main actor (backend/main.mo)."
  ],
  "nonGoals": [
    "Changing the visual theme or layout of any existing dashboard charts.",
    "Adding audience breakdown by demographic profile to this new KPI (that already exists in AudienceByProfileChart).",
    "Modifying the existing month/museum filter controls on the dashboard unrelated to the new Público Geral metric."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}