{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add 'Público Geral' metric with period filters to Dashboard",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Add a 'Público Geral' KPI card to the Dashboard with period selector (monthly, cumulative, custom range) that fetches and displays total general audience",
      "acceptanceCriteria": [
        "A 'Público Geral' KPI card is visible on the DashboardPage.",
        "A period selector with three options is rendered near or within the KPI card: 'Mês Atual', 'Acumulado', 'Período Customizado'.",
        "Selecting 'Mês Atual' fetches and displays the audience total for the current calendar month and year.",
        "Selecting 'Acumulado' fetches and displays the cumulative audience total across all records.",
        "Selecting 'Período Customizado' reveals two month+year pickers (start and end); the card updates when valid dates are selected.",
        "The card displays a loading state while the query is in flight and an error state if the query fails.",
        "The KPI card uses the existing KPICard component and visual design system for consistency."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new React Query hook `useGetTotalGeneralAudience(queryType: AudienceQueryType)` that calls the backend `getTotalGeneralAudience` function and returns the total audience bigint with loading/error states."
        },
        {
          "path": "frontend/src/components/dashboard/PublicoGeralCard.tsx",
          "operation": "create",
          "description": "Create a new component that renders a KPICard for 'Público Geral' with three period modes: 'Mês Atual' (current month), 'Acumulado' (cumulative), and 'Período Customizado' (custom date range). When 'Período Customizado' is selected, display two month+year pickers using select elements for Month enum and Year. Use the useGetTotalGeneralAudience hook with the selected period mode. Display loading and error states appropriately. Format the audience number with locale formatting."
        },
        {
          "path": "frontend/src/pages/DashboardPage.tsx",
          "operation": "modify",
          "description": "Import and render the new PublicoGeralCard component in the KPI cards section at the top of the dashboard, placing it alongside the existing KPI cards (Total de Relatórios, Total de Atividades, Total de Horas, Total de Público). Ensure consistent grid layout and spacing with the existing KPI cards."
        },
        {
          "path": "frontend/src/utils/labels.ts",
          "operation": "modify",
          "description": "Add a helper function `getMonthOptions()` that returns an array of { value: Month, label: string } for all Month enum values to support the month picker in PublicoGeralCard. Add a helper function `formatAudienceNumber(audience: bigint): string` that formats large audience numbers with locale-aware thousand separators."
        }
      ]
    }
  ]
}