{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Grant Coordinator Role Access to Create Reports and Insert Activities",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Update Sidebar navigation to show report and activity creation options for coordinator role",
      "acceptanceCriteria": [
        "When logged in as a coordinator, the Sidebar displays the navigation option to create a new report.",
        "When logged in as a coordinator and viewing a report, the option to add a new activity is visible and functional.",
        "No navigation items are broken for other roles."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Sidebar.tsx",
          "operation": "modify",
          "description": "Update the role-based navigation logic to include 'Create Report' menu item for coordinator role (AppUserRole.coordination). Ensure coordinators can see the 'Reports' menu item and any associated create/new report navigation. Verify that the conditional rendering checks include coordination role alongside professional and administration roles where report creation is relevant."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Ensure ReportFormPage and ActivityFormPage are fully editable for coordinator users in create mode",
      "acceptanceCriteria": [
        "A coordinator user can fill out and submit the report creation form without fields being disabled or the form being read-only.",
        "A coordinator user can fill out and submit the activity creation form without fields being disabled.",
        "Role-based read-only logic in ReportFormPage does not block coordinators in create mode."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ReportFormPage.tsx",
          "operation": "modify",
          "description": "Update the role-based read-only logic to ensure coordinator role (AppUserRole.coordination) has full edit and submit permissions when creating a new report. Review any conditional logic that checks user role against professional or administration and add coordination to the permitted roles for create operations. Ensure form fields are not disabled and submit buttons are enabled for coordinators in create mode."
        },
        {
          "path": "frontend/src/pages/ActivityFormPage.tsx",
          "operation": "modify",
          "description": "Update role-based form logic to ensure coordinator role (AppUserRole.coordination) can create and submit new activities without restrictions. Review any permission checks or read-only conditions and ensure coordination role is included alongside professional and administration roles. Verify that all form fields remain editable and the submit action is enabled for coordinators."
        },
        {
          "path": "frontend/src/components/ActivitiesList.tsx",
          "operation": "modify",
          "description": "Ensure the 'Add Activity' button or navigation to ActivityFormPage is visible and functional for coordinator users. Update any role-based conditional rendering to include AppUserRole.coordination alongside professional role so coordinators can access the activity creation flow from the activities list."
        }
      ]
    }
  ]
}